import { Box, Button, ButtonGroup, Flex, Text, VStack } from "@chakra-ui/react";
import { HospitalLayout } from "@lib/admin/ui/layout/HospitalLayout";
import { HospitalIdentify } from "@lib/admin/ui/pages/Hospital/HospitalIdentify";
import { withRequireLogin } from "@lib/auth/ui";
import { color } from "framer-motion";
const identifyData = [
  {
    title: "Сувгийн эмчилгээний таниулах зөвшөөрөл",
    content: [
      "Сувгийн эмчилгээ нь гүн цоорлын үед зөөлц ил гарах, зөөлц үрэвсэх, сурвалжийн оройн үрэвслийн үед хийгддэг. Үүнээс гадна шүдний гаж хэлбэр, буруу байрлал, шүд цуурах, шүд гэмтэх (гадны нөлөөгөөр) зэргээс болж хийгдэж болно.",
      "Сувгийн эмчилгээ нь шүдний суваг болгоны зөөлцийг авч сувгийг цэвэрлэн сувгийг ломбодох процесс бөгөөд энэ нь олон удаагийн давтан эмчилгээгээр дуусна.",
      "Эмчилгээ эхэлсний дараа тухайн шүд хүндүүр орч болох тул эмчилгээ дуустал нөгөө талаараа хоол идэхийг зөвлөнө. Энэ нь ихэнхдээ 2 долоо хоногийн дараа намдах боловч тухайн нөхцлөөс хамааран хэдэн сар ч үргэлжлэх боломжтой.",
      "Шүдний ёзоор хүртэл цуурал үүссэн тохиолдолд энэ нь нүдэнд харагдахгүй бөгөөд эмчилгээ хичнээн чанартай хийгдсэн ч цуурлын улмаас шүдийг авах тохиолдол гарч болно.",
      "Эмчилгээ хийлгэсэн шүдний хана нимгэрсэн (ялангуяа шүдний хүзүү хэсэг) байдаг учир зажлалтын ачаалал даахгүйгээс амархан хугарч болно. Иймээс бүрээс хийлгэж цөгцийг сэргээснээр шүдний хугарлаас урьдчилан сэргийлж чадна.",
      "Шүдний сувгийн бүтэц нарийн төвөгтөй (нэмэлт микро сувгуудтай) учраас сувгийн доторх зөөлцийг бүрэн цэвэрлэх боломжгүй байдаг. Бага зарэг зөөлц үлдсэн ч дархлааны систем үрэвслийг дарж өгдөг.",
      "Тиймээс бүх сувгийн эмчилгээ амжилттай болно гэсэн үг биш бөгөөд 5~10% нь дахин сувгийн эмчилгээ хийлгэх эсвэл сурвалжийн орой тайрах, шүд а авах мэс ажилбар хийгдэхийг анхаарна уу!",
    ],
    signature: "",
  },
  {
    title: "Сувгийн таниулах зөвшөөрөл",
    content: [
      "Сувгийн эмчилгээ нь шүдний суваг болгоны зөөлцийг авч сувгийг цэвэрлэн сувгийг ломбодох процесс бөгөөд энэ нь олон удаагийн давтан эмчилгээгээр дуусна",
      "Шүдний ёзоор хүртэл цуурал үүссэн тохиолдолд энэ нь нүдэнд харагдахгүй бөгөөд эмчилгээ хичнээн чанартай хийгдсэн ч цуурлын улмаас шүдийг авах тохиолдол гарч болно",
      "Эмчилгээ хийлгэсэн шүдний хана нимгэрсэн (ялангуяа шүдний хүзүү хэсэг) байдаг учир зажлалтын ачаалал даахгүйгээс амархан хугарч болно. Иймээс бүрээс хийлгэж цөгцийг сэргээснээр шүдний хугарлаас урьдчилан сэргийлж чадна",
      "Шүдний сувгийн бүтэц нарийн төвөгтөй (нэмэлт микро сувгуудтай) учраас сувгийн доторх зөөлцийг бүрэн цэвэрлэх боломжгүй байдаг. Бага зарэг зөөлц үлдсэн ч дархлааны систем үрэвслийг дарж өгдөг",
      "Тиймээс бүх сувгийн эмчилгээ амжилттай болно гэсэн үг биш бөгөөд 5~10% нь дахин сувгийн эмчилгээ хийлгэх эсвэл сурвалжийн орой тайрах, шүд а авах мэс ажилбар хийгдэхийг анхаарна уу",
    ],
    signature: "",
  },
];
const HospitalIdentifyPage = () => (
  <HospitalLayout>
    <Text fontSize={24} mb={8}>
      Таниулах зөвшөөрөл
    </Text>
    <VStack spacing={4}>
      {identifyData.map((item, index) => (
        <HospitalIdentify
          title={item.title}
          content={item.content}
          signature={item.signature}
          key={index}
        />
      ))}
    </VStack>
  </HospitalLayout>
);
export default withRequireLogin(HospitalIdentifyPage);
